luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_FSR_Bits.RFO */
#define IFX_ERAY_FSR_RFO_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_FSR_Bits.RFO */
#define IFX_ERAY_FSR_RFO_OFF (2u)

/** \brief  Length for Ifx_ERAY_GTUC01_Bits.UT */
#define IFX_ERAY_GTUC01_UT_LEN (20u)

/** \brief  Mask for Ifx_ERAY_GTUC01_Bits.UT */
#define IFX_ERAY_GTUC01_UT_MSK (0xfffffu)

/** \brief  Offset for Ifx_ERAY_GTUC01_Bits.UT */
#define IFX_ERAY_GTUC01_UT_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC02_Bits.MPC */
#define IFX_ERAY_GTUC02_MPC_LEN (14u)

/** \brief  Mask for Ifx_ERAY_GTUC02_Bits.MPC */
#define IFX_ERAY_GTUC02_MPC_MSK (0x3fffu)

/** \brief  Offset for Ifx_ERAY_GTUC02_Bits.MPC */
#define IFX_ERAY_GTUC02_MPC_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC02_Bits.SNM */
#define IFX_ERAY_GTUC02_SNM_LEN (4u)

/** \brief  Mask for Ifx_ERAY_GTUC02_Bits.SNM */
#define IFX_ERAY_GTUC02_SNM_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_GTUC02_Bits.SNM */
#define IFX_ERAY_GTUC02_SNM_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC03_Bits.MIOA */
#define IFX_ERAY_GTUC03_MIOA_LEN (7u)

/** \brief  Mask for Ifx_ERAY_GTUC03_Bits.MIOA */
#define IFX_ERAY_GTUC03_MIOA_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_GTUC03_Bits.MIOA */
#define IFX_ERAY_GTUC03_MIOA_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC03_Bits.MIOB */
#define IFX_ERAY_GTUC03_MIOB_LEN (7u)

/** \brief  Mask for Ifx_ERAY_GTUC03_Bits.MIOB */
#define IFX_ERAY_GTUC03_MIOB_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_GTUC03_Bits.MIOB */
#define IFX_ERAY_GTUC03_MIOB_OFF (24u)

/** \brief  Length for Ifx_ERAY_GTUC03_Bits.UIOA */
#define IFX_ERAY_GTUC03_UIOA_LEN (8u)

/** \brief  Mask for Ifx_ERAY_GTUC03_Bits.UIOA */
#define IFX_ERAY_GTUC03_UIOA_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_GTUC03_Bits.UIOA */
#define IFX_ERAY_GTUC03_UIOA_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC03_Bits.UIOB */
#define IFX_ERAY_GTUC03_UIOB_LEN (8u)

/** \brief  Mask for Ifx_ERAY_GTUC03_Bits.UIOB */
#define IFX_ERAY_GTUC03_UIOB_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_GTUC03_Bits.UIOB */
#define IFX_ERAY_GTUC03_UIOB_OFF (8u)

/** \brief  Length for Ifx_ERAY_GTUC04_Bits.NIT */
#define IFX_ERAY_GTUC04_NIT_LEN (14u)

/** \brief  Mask for Ifx_ERAY_GTUC04_Bits.NIT */
#define IFX_ERAY_GTUC04_NIT_MSK (0x3fffu)

/** \brief  Offset for Ifx_ERAY_GTUC04_Bits.NIT */
#define IFX_ERAY_GTUC04_NIT_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC04_Bits.OCS */
#define IFX_ERAY_GTUC04_OCS_LEN (14u)

/** \brief  Mask for Ifx_ERAY_GTUC04_Bits.OCS */
#define IFX_ERAY_GTUC04_OCS_MSK (0x3fffu)

/** \brief  Offset for Ifx_ERAY_GTUC04_Bits.OCS */
#define IFX_ERAY_GTUC04_OCS_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC05_Bits.CDD */
#define IFX_ERAY_GTUC05_CDD_LEN (5u)

/** \brief  Mask for Ifx_ERAY_GTUC05_Bits.CDD */
#define IFX_ERAY_GTUC05_CDD_MSK (0x1fu)

/** \brief  Offset for Ifx_ERAY_GTUC05_Bits.CDD */
#define IFX_ERAY_GTUC05_CDD_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC05_Bits.DCA */
#define IFX_ERAY_GTUC05_DCA_LEN (8u)

/** \brief  Mask for Ifx_ERAY_GTUC05_Bits.DCA */
#define IFX_ERAY_GTUC05_DCA_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_GTUC05_Bits.DCA */
#define IFX_ERAY_GTUC05_DCA_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC05_Bits.DCB */
#define IFX_ERAY_GTUC05_DCB_LEN (8u)

/** \brief  Mask for Ifx_ERAY_GTUC05_Bits.DCB */
#define IFX_ERAY_GTUC05_DCB_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_GTUC05_Bits.DCB */
#define IFX_ERAY_GTUC05_DCB_OFF (8u)

/** \brief  Length for Ifx_ERAY_GTUC05_Bits.DEC */
#define IFX_ERAY_GTUC05_DEC_LEN (8u)

/** \brief  Mask for Ifx_ERAY_GTUC05_Bits.DEC */
#define IFX_ERAY_GTUC05_DEC_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_GTUC05_Bits.DEC */
#define IFX_ERAY_GTUC05_DEC_OFF (24u)

/** \brief  Length for Ifx_ERAY_GTUC06_Bits.ASR */
#define IFX_ERAY_GTUC06_ASR_LEN (11u)

/** \brief  Mask for Ifx_ERAY_GTUC06_Bits.ASR */
#define IFX_ERAY_GTUC06_ASR_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_GTUC06_Bits.ASR */
#define IFX_ERAY_GTUC06_ASR_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC06_Bits.MOD */
#define IFX_ERAY_GTUC06_MOD_LEN (11u)

/** \brief  Mask for Ifx_ERAY_GTUC06_Bits.MOD */
#define IFX_ERAY_GTUC06_MOD_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_GTUC06_Bits.MOD */
#define IFX_ERAY_GTUC06_MOD_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC07_Bits.NSS */
#define IFX_ERAY_GTUC07_NSS_LEN (10u)

/** \brief  Mask for Ifx_ERAY_GTUC07_Bits.NSS */
#define IFX_ERAY_GTUC07_NSS_MSK (0x3ffu)

/** \brief  Offset for Ifx_ERAY_GTUC07_Bits.NSS */
#define IFX_ERAY_GTUC07_NSS_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC07_Bits.SSL */
#define IFX_ERAY_GTUC07_SSL_LEN (10u)

/** \brief  Mask for Ifx_ERAY_GTUC07_Bits.SSL */
#define IFX_ERAY_GTUC07_SSL_MSK (0x3ffu)

/** \brief  Offset for Ifx_ERAY_GTUC07_Bits.SSL */
#define IFX_ERAY_GTUC07_SSL_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC08_Bits.MSL */
#define IFX_ERAY_GTUC08_MSL_LEN (6u)

/** \brief  Mask for Ifx_ERAY_GTUC08_Bits.MSL */
#define IFX_ERAY_GTUC08_MSL_MSK (0x3fu)

/** \brief  Offset for Ifx_ERAY_GTUC08_Bits.MSL */
#define IFX_ERAY_GTUC08_MSL_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC08_Bits.NMS */
#define IFX_ERAY_GTUC08_NMS_LEN (13u)

/** \brief  Mask for Ifx_ERAY_GTUC08_Bits.NMS */
#define IFX_ERAY_GTUC08_NMS_MSK (0x1fffu)

/** \brief  Offset for Ifx_ERAY_GTUC08_Bits.NMS */
#define IFX_ERAY_GTUC08_NMS_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC09_Bits.APO */
#define IFX_ERAY_GTUC09_APO_LEN (6u)

/** \brief  Mask for Ifx_ERAY_GTUC09_Bits.APO */
#define IFX_ERAY_GTUC09_APO_MSK (0x3fu)

/** \brief  Offset for Ifx_ERAY_GTUC09_Bits.APO */
#define IFX_ERAY_GTUC09_APO_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC09_Bits.DSI */
#define IFX_ERAY_GTUC09_DSI_LEN (2u)

/** \brief  Mask for Ifx_ERAY_GTUC09_Bits.DSI */
#define IFX_ERAY_GTUC09_DSI_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_GTUC09_Bits.DSI */
#define IFX_ERAY_GTUC09_DSI_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC09_Bits.MAPO */
#define IFX_ERAY_GTUC09_MAPO_LEN (5u)

/** \brief  Mask for Ifx_ERAY_GTUC09_Bits.MAPO */
#define IFX_ERAY_GTUC09_MAPO_MSK (0x1fu)

