luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC117 */
#define IFX_ERAY_MBSC4_MBC117_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC117 */
#define IFX_ERAY_MBSC4_MBC117_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC117 */
#define IFX_ERAY_MBSC4_MBC117_OFF (21u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC118 */
#define IFX_ERAY_MBSC4_MBC118_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC118 */
#define IFX_ERAY_MBSC4_MBC118_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC118 */
#define IFX_ERAY_MBSC4_MBC118_OFF (22u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC119 */
#define IFX_ERAY_MBSC4_MBC119_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC119 */
#define IFX_ERAY_MBSC4_MBC119_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC119 */
#define IFX_ERAY_MBSC4_MBC119_OFF (23u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC120 */
#define IFX_ERAY_MBSC4_MBC120_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC120 */
#define IFX_ERAY_MBSC4_MBC120_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC120 */
#define IFX_ERAY_MBSC4_MBC120_OFF (24u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC121 */
#define IFX_ERAY_MBSC4_MBC121_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC121 */
#define IFX_ERAY_MBSC4_MBC121_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC121 */
#define IFX_ERAY_MBSC4_MBC121_OFF (25u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC122 */
#define IFX_ERAY_MBSC4_MBC122_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC122 */
#define IFX_ERAY_MBSC4_MBC122_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC122 */
#define IFX_ERAY_MBSC4_MBC122_OFF (26u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC123 */
#define IFX_ERAY_MBSC4_MBC123_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC123 */
#define IFX_ERAY_MBSC4_MBC123_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC123 */
#define IFX_ERAY_MBSC4_MBC123_OFF (27u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC124 */
#define IFX_ERAY_MBSC4_MBC124_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC124 */
#define IFX_ERAY_MBSC4_MBC124_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC124 */
#define IFX_ERAY_MBSC4_MBC124_OFF (28u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC125 */
#define IFX_ERAY_MBSC4_MBC125_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC125 */
#define IFX_ERAY_MBSC4_MBC125_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC125 */
#define IFX_ERAY_MBSC4_MBC125_OFF (29u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC126 */
#define IFX_ERAY_MBSC4_MBC126_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC126 */
#define IFX_ERAY_MBSC4_MBC126_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC126 */
#define IFX_ERAY_MBSC4_MBC126_OFF (30u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC127 */
#define IFX_ERAY_MBSC4_MBC127_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC127 */
#define IFX_ERAY_MBSC4_MBC127_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC127 */
#define IFX_ERAY_MBSC4_MBC127_OFF (31u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC96 */
#define IFX_ERAY_MBSC4_MBC96_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC96 */
#define IFX_ERAY_MBSC4_MBC96_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC96 */
#define IFX_ERAY_MBSC4_MBC96_OFF (0u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC97 */
#define IFX_ERAY_MBSC4_MBC97_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC97 */
#define IFX_ERAY_MBSC4_MBC97_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC97 */
#define IFX_ERAY_MBSC4_MBC97_OFF (1u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC98 */
#define IFX_ERAY_MBSC4_MBC98_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC98 */
#define IFX_ERAY_MBSC4_MBC98_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC98 */
#define IFX_ERAY_MBSC4_MBC98_OFF (2u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC99 */
#define IFX_ERAY_MBSC4_MBC99_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC99 */
#define IFX_ERAY_MBSC4_MBC99_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC99 */
#define IFX_ERAY_MBSC4_MBC99_OFF (3u)

/** \brief  Length for Ifx_ERAY_MHDC_Bits.SFDL */
#define IFX_ERAY_MHDC_SFDL_LEN (7u)

/** \brief  Mask for Ifx_ERAY_MHDC_Bits.SFDL */
#define IFX_ERAY_MHDC_SFDL_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_MHDC_Bits.SFDL */
#define IFX_ERAY_MHDC_SFDL_OFF (0u)

/** \brief  Length for Ifx_ERAY_MHDC_Bits.SLT */
#define IFX_ERAY_MHDC_SLT_LEN (13u)

/** \brief  Mask for Ifx_ERAY_MHDC_Bits.SLT */
#define IFX_ERAY_MHDC_SLT_MSK (0x1fffu)

/** \brief  Offset for Ifx_ERAY_MHDC_Bits.SLT */
#define IFX_ERAY_MHDC_SLT_OFF (16u)

/** \brief  Length for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_OFF (2u)

/** \brief  Length for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_OFF (3u)

/** \brief  Length for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_OFF (0u)

/** \brief  Length for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDF_Bits.SNUB */
#define IFX_ERAY_MHDF_SNUB_OFF (1u)

/** \brief  Length for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDF_Bits.TBFA */
#define IFX_ERAY_MHDF_TBFA_OFF (4u)

/** \brief  Length for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDF_Bits.TBFB */
#define IFX_ERAY_MHDF_TBFB_OFF (5u)

