luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDF_Bits.TNSA */
#define IFX_ERAY_MHDF_TNSA_OFF (6u)

/** \brief  Length for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDF_Bits.TNSB */
#define IFX_ERAY_MHDF_TNSB_OFF (7u)

/** \brief  Length for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDF_Bits.WAHP */
#define IFX_ERAY_MHDF_WAHP_OFF (8u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.CRAM */
#define IFX_ERAY_MHDS_CRAM_OFF (7u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.EIBF */
#define IFX_ERAY_MHDS_EIBF_OFF (0u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.EMR */
#define IFX_ERAY_MHDS_EMR_OFF (2u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.EOBF */
#define IFX_ERAY_MHDS_EOBF_OFF (1u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.ETBF1 */
#define IFX_ERAY_MHDS_ETBF1_OFF (3u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.ETBF2 */
#define IFX_ERAY_MHDS_ETBF2_OFF (4u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_LEN (7u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.FMB */
#define IFX_ERAY_MHDS_FMB_OFF (8u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.FMBD */
#define IFX_ERAY_MHDS_FMBD_OFF (5u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_LEN (7u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.MBT */
#define IFX_ERAY_MHDS_MBT_OFF (16u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_LEN (7u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.MBU */
#define IFX_ERAY_MHDS_MBU_OFF (24u)

/** \brief  Length for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MHDS_Bits.MFMB */
#define IFX_ERAY_MHDS_MFMB_OFF (6u)

/** \brief  Length for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_LEN (8u)

/** \brief  Mask for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_OFF (0u)

/** \brief  Length for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_LEN (8u)

/** \brief  Mask for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_OFF (8u)

/** \brief  Length for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_LEN (8u)

/** \brief  Mask for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_OFF (16u)

/** \brief  Length for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_LEN (2u)

/** \brief  Mask for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_OFF (24u)

/** \brief  Length for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_OFF (26u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_OFF (0u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP10 */
#define IFX_ERAY_MSIC1_MSIP10_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP10 */
#define IFX_ERAY_MSIC1_MSIP10_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP10 */
#define IFX_ERAY_MSIC1_MSIP10_OFF (10u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP11 */
#define IFX_ERAY_MSIC1_MSIP11_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP11 */
#define IFX_ERAY_MSIC1_MSIP11_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP11 */
#define IFX_ERAY_MSIC1_MSIP11_OFF (11u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP12 */
#define IFX_ERAY_MSIC1_MSIP12_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP12 */
#define IFX_ERAY_MSIC1_MSIP12_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP12 */
#define IFX_ERAY_MSIC1_MSIP12_OFF (12u)

