luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_OFF (1u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_OFF (2u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_OFF (3u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_OFF (0u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_OFF (10u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_OFF (11u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_OFF (12u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_OFF (13u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_OFF (14u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_OFF (15u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_OFF (16u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_OFF (17u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_OFF (18u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_OFF (19u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_OFF (1u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP20 */
#define IFX_ERAY_NDIC1_NDIP20_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP20 */
#define IFX_ERAY_NDIC1_NDIP20_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP20 */
#define IFX_ERAY_NDIC1_NDIP20_OFF (20u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP21 */
#define IFX_ERAY_NDIC1_NDIP21_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP21 */
#define IFX_ERAY_NDIC1_NDIP21_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP21 */
#define IFX_ERAY_NDIC1_NDIP21_OFF (21u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP22 */
#define IFX_ERAY_NDIC1_NDIP22_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP22 */
#define IFX_ERAY_NDIC1_NDIP22_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP22 */
#define IFX_ERAY_NDIC1_NDIP22_OFF (22u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP23 */
#define IFX_ERAY_NDIC1_NDIP23_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP23 */
#define IFX_ERAY_NDIC1_NDIP23_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP23 */
#define IFX_ERAY_NDIC1_NDIP23_OFF (23u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP24 */
#define IFX_ERAY_NDIC1_NDIP24_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP24 */
#define IFX_ERAY_NDIC1_NDIP24_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP24 */
#define IFX_ERAY_NDIC1_NDIP24_OFF (24u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP25 */
#define IFX_ERAY_NDIC1_NDIP25_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP25 */
#define IFX_ERAY_NDIC1_NDIP25_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP25 */
#define IFX_ERAY_NDIC1_NDIP25_OFF (25u)

/** \brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP26 */
#define IFX_ERAY_NDIC1_NDIP26_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP26 */
#define IFX_ERAY_NDIC1_NDIP26_MSK (0x1u)

