luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_OFF (28u)

/** \brief  Length for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_LEN (6u)

/** \brief  Mask for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_MSK (0x3fu)

/** \brief  Offset for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_OFF (16u)

/** \brief  Length for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_OFF (24u)

/** \brief  Length for Ifx_ERAY_RDHS3_Bits.RES */
#define IFX_ERAY_RDHS3_RES_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS3_Bits.RES */
#define IFX_ERAY_RDHS3_RES_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS3_Bits.RES */
#define IFX_ERAY_RDHS3_RES_OFF (29u)

/** \brief  Length for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_OFF (25u)

/** \brief  Length for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_OFF (26u)

/** \brief  Length for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_LEN (11u)

/** \brief  Mask for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_OFF (0u)

/** \brief  Length for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_LEN (11u)

/** \brief  Mask for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_OFF (16u)

/** \brief  Length for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_OFF (16u)

/** \brief  Length for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_OFF (18u)

/** \brief  Length for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_OFF (17u)

/** \brief  Length for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_OFF (19u)

/** \brief  Length for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_LEN (4u)

/** \brief  Mask for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_OFF (0u)

/** \brief  Length for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_LEN (4u)

/** \brief  Mask for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_OFF (4u)

/** \brief  Length for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_LEN (4u)

/** \brief  Mask for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_OFF (8u)

/** \brief  Length for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_LEN (4u)

/** \brief  Mask for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_OFF (12u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_OFF (1u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_OFF (2u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_OFF (14u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_OFF (17u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.MTSBE */
#define IFX_ERAY_SIER_MTSBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.MTSBE */
#define IFX_ERAY_SIER_MTSBE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.MTSBE */
#define IFX_ERAY_SIER_MTSBE_OFF (25u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.NMVCE */
#define IFX_ERAY_SIER_NMVCE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.NMVCE */
#define IFX_ERAY_SIER_NMVCE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.NMVCE */
#define IFX_ERAY_SIER_NMVCE_OFF (7u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.RFCLE */
#define IFX_ERAY_SIER_RFCLE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.RFCLE */
#define IFX_ERAY_SIER_RFCLE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.RFCLE */
#define IFX_ERAY_SIER_RFCLE_OFF (6u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.RFNEE */
#define IFX_ERAY_SIER_RFNEE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.RFNEE */
#define IFX_ERAY_SIER_RFNEE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.RFNEE */
#define IFX_ERAY_SIER_RFNEE_OFF (5u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.RXIE */
#define IFX_ERAY_SIER_RXIE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.RXIE */
#define IFX_ERAY_SIER_RXIE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.RXIE */
#define IFX_ERAY_SIER_RXIE_OFF (4u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.SDSE */
#define IFX_ERAY_SIER_SDSE_LEN (1u)

