luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_SIER_Bits.SDSE */
#define IFX_ERAY_SIER_SDSE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.SDSE */
#define IFX_ERAY_SIER_SDSE_OFF (15u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.SUCSE */
#define IFX_ERAY_SIER_SUCSE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.SUCSE */
#define IFX_ERAY_SIER_SUCSE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.SUCSE */
#define IFX_ERAY_SIER_SUCSE_OFF (13u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.SWEE */
#define IFX_ERAY_SIER_SWEE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.SWEE */
#define IFX_ERAY_SIER_SWEE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.SWEE */
#define IFX_ERAY_SIER_SWEE_OFF (12u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.TI0E */
#define IFX_ERAY_SIER_TI0E_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.TI0E */
#define IFX_ERAY_SIER_TI0E_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.TI0E */
#define IFX_ERAY_SIER_TI0E_OFF (8u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.TI1E */
#define IFX_ERAY_SIER_TI1E_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.TI1E */
#define IFX_ERAY_SIER_TI1E_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.TI1E */
#define IFX_ERAY_SIER_TI1E_OFF (9u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.TIBCE */
#define IFX_ERAY_SIER_TIBCE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.TIBCE */
#define IFX_ERAY_SIER_TIBCE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.TIBCE */
#define IFX_ERAY_SIER_TIBCE_OFF (10u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.TOBCE */
#define IFX_ERAY_SIER_TOBCE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.TOBCE */
#define IFX_ERAY_SIER_TOBCE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.TOBCE */
#define IFX_ERAY_SIER_TOBCE_OFF (11u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.TXIE */
#define IFX_ERAY_SIER_TXIE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.TXIE */
#define IFX_ERAY_SIER_TXIE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.TXIE */
#define IFX_ERAY_SIER_TXIE_OFF (3u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.WSTE */
#define IFX_ERAY_SIER_WSTE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.WSTE */
#define IFX_ERAY_SIER_WSTE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.WSTE */
#define IFX_ERAY_SIER_WSTE_OFF (0u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.WUPAE */
#define IFX_ERAY_SIER_WUPAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.WUPAE */
#define IFX_ERAY_SIER_WUPAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.WUPAE */
#define IFX_ERAY_SIER_WUPAE_OFF (16u)

/** \brief  Length for Ifx_ERAY_SIER_Bits.WUPBE */
#define IFX_ERAY_SIER_WUPBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIER_Bits.WUPBE */
#define IFX_ERAY_SIER_WUPBE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIER_Bits.WUPBE */
#define IFX_ERAY_SIER_WUPBE_OFF (24u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.CASE */
#define IFX_ERAY_SIES_CASE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.CASE */
#define IFX_ERAY_SIES_CASE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.CASE */
#define IFX_ERAY_SIES_CASE_OFF (1u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.CYCSE */
#define IFX_ERAY_SIES_CYCSE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.CYCSE */
#define IFX_ERAY_SIES_CYCSE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.CYCSE */
#define IFX_ERAY_SIES_CYCSE_OFF (2u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.MBSIE */
#define IFX_ERAY_SIES_MBSIE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.MBSIE */
#define IFX_ERAY_SIES_MBSIE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.MBSIE */
#define IFX_ERAY_SIES_MBSIE_OFF (14u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.MTSAE */
#define IFX_ERAY_SIES_MTSAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.MTSAE */
#define IFX_ERAY_SIES_MTSAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.MTSAE */
#define IFX_ERAY_SIES_MTSAE_OFF (17u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.MTSBE */
#define IFX_ERAY_SIES_MTSBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.MTSBE */
#define IFX_ERAY_SIES_MTSBE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.MTSBE */
#define IFX_ERAY_SIES_MTSBE_OFF (25u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.NMVCE */
#define IFX_ERAY_SIES_NMVCE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.NMVCE */
#define IFX_ERAY_SIES_NMVCE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.NMVCE */
#define IFX_ERAY_SIES_NMVCE_OFF (7u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.RFCLE */
#define IFX_ERAY_SIES_RFCLE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.RFCLE */
#define IFX_ERAY_SIES_RFCLE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.RFCLE */
#define IFX_ERAY_SIES_RFCLE_OFF (6u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.RFNEE */
#define IFX_ERAY_SIES_RFNEE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.RFNEE */
#define IFX_ERAY_SIES_RFNEE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.RFNEE */
#define IFX_ERAY_SIES_RFNEE_OFF (5u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.RXIE */
#define IFX_ERAY_SIES_RXIE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.RXIE */
#define IFX_ERAY_SIES_RXIE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.RXIE */
#define IFX_ERAY_SIES_RXIE_OFF (4u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.SDSE */
#define IFX_ERAY_SIES_SDSE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.SDSE */
#define IFX_ERAY_SIES_SDSE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.SDSE */
#define IFX_ERAY_SIES_SDSE_OFF (15u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.SUCSE */
#define IFX_ERAY_SIES_SUCSE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.SUCSE */
#define IFX_ERAY_SIES_SUCSE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.SUCSE */
#define IFX_ERAY_SIES_SUCSE_OFF (13u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.SWEE */
#define IFX_ERAY_SIES_SWEE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.SWEE */
#define IFX_ERAY_SIES_SWEE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.SWEE */
#define IFX_ERAY_SIES_SWEE_OFF (12u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.TI0E */
#define IFX_ERAY_SIES_TI0E_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.TI0E */
#define IFX_ERAY_SIES_TI0E_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.TI0E */
#define IFX_ERAY_SIES_TI0E_OFF (8u)

/** \brief  Length for Ifx_ERAY_SIES_Bits.TI1E */
#define IFX_ERAY_SIES_TI1E_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIES_Bits.TI1E */
#define IFX_ERAY_SIES_TI1E_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIES_Bits.TI1E */
#define IFX_ERAY_SIES_TI1E_OFF (9u)

