luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_SIR_Bits.MTSA */
#define IFX_ERAY_SIR_MTSA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.MTSA */
#define IFX_ERAY_SIR_MTSA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.MTSA */
#define IFX_ERAY_SIR_MTSA_OFF (17u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.MTSB */
#define IFX_ERAY_SIR_MTSB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.MTSB */
#define IFX_ERAY_SIR_MTSB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.MTSB */
#define IFX_ERAY_SIR_MTSB_OFF (25u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.NMVC */
#define IFX_ERAY_SIR_NMVC_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.NMVC */
#define IFX_ERAY_SIR_NMVC_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.NMVC */
#define IFX_ERAY_SIR_NMVC_OFF (7u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.RFCL */
#define IFX_ERAY_SIR_RFCL_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.RFCL */
#define IFX_ERAY_SIR_RFCL_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.RFCL */
#define IFX_ERAY_SIR_RFCL_OFF (6u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.RFNE */
#define IFX_ERAY_SIR_RFNE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.RFNE */
#define IFX_ERAY_SIR_RFNE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.RFNE */
#define IFX_ERAY_SIR_RFNE_OFF (5u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.RXI */
#define IFX_ERAY_SIR_RXI_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.RXI */
#define IFX_ERAY_SIR_RXI_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.RXI */
#define IFX_ERAY_SIR_RXI_OFF (4u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.SDS */
#define IFX_ERAY_SIR_SDS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.SDS */
#define IFX_ERAY_SIR_SDS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.SDS */
#define IFX_ERAY_SIR_SDS_OFF (15u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.SUCS */
#define IFX_ERAY_SIR_SUCS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.SUCS */
#define IFX_ERAY_SIR_SUCS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.SUCS */
#define IFX_ERAY_SIR_SUCS_OFF (13u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.SWE */
#define IFX_ERAY_SIR_SWE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.SWE */
#define IFX_ERAY_SIR_SWE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.SWE */
#define IFX_ERAY_SIR_SWE_OFF (12u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.TI0 */
#define IFX_ERAY_SIR_TI0_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.TI0 */
#define IFX_ERAY_SIR_TI0_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.TI0 */
#define IFX_ERAY_SIR_TI0_OFF (8u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_OFF (9u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_OFF (10u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_OFF (11u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_OFF (3u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_OFF (0u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_OFF (16u)

/** \brief  Length for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_OFF (24u)

/** \brief  Length for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_OFF (2u)

/** \brief  Length for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_LEN (1u)

/** \brief  Mask for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_OFF (4u)

/** \brief  Length for Ifx_ERAY_STPW1_Bits.EINT0 */
#define IFX_ERAY_STPW1_EINT0_LEN (1u)

/** \brief  Mask for Ifx_ERAY_STPW1_Bits.EINT0 */
#define IFX_ERAY_STPW1_EINT0_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_STPW1_Bits.EINT0 */
#define IFX_ERAY_STPW1_EINT0_OFF (5u)

/** \brief  Length for Ifx_ERAY_STPW1_Bits.EINT1 */
#define IFX_ERAY_STPW1_EINT1_LEN (1u)

/** \brief  Mask for Ifx_ERAY_STPW1_Bits.EINT1 */
#define IFX_ERAY_STPW1_EINT1_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_STPW1_Bits.EINT1 */
#define IFX_ERAY_STPW1_EINT1_OFF (6u)

/** \brief  Length for Ifx_ERAY_STPW1_Bits.ESWT */
#define IFX_ERAY_STPW1_ESWT_LEN (1u)

/** \brief  Mask for Ifx_ERAY_STPW1_Bits.ESWT */
#define IFX_ERAY_STPW1_ESWT_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_STPW1_Bits.ESWT */
#define IFX_ERAY_STPW1_ESWT_OFF (0u)

/** \brief  Length for Ifx_ERAY_STPW1_Bits.SCCV */
#define IFX_ERAY_STPW1_SCCV_LEN (6u)

/** \brief  Mask for Ifx_ERAY_STPW1_Bits.SCCV */
#define IFX_ERAY_STPW1_SCCV_MSK (0x3fu)

/** \brief  Offset for Ifx_ERAY_STPW1_Bits.SCCV */
#define IFX_ERAY_STPW1_SCCV_OFF (8u)

/** \brief  Length for Ifx_ERAY_STPW1_Bits.SMTV */
#define IFX_ERAY_STPW1_SMTV_LEN (14u)

/** \brief  Mask for Ifx_ERAY_STPW1_Bits.SMTV */
#define IFX_ERAY_STPW1_SMTV_MSK (0x3fffu)

/** \brief  Offset for Ifx_ERAY_STPW1_Bits.SMTV */
#define IFX_ERAY_STPW1_SMTV_OFF (16u)

/** \brief  Length for Ifx_ERAY_STPW1_Bits.SSWT */
#define IFX_ERAY_STPW1_SSWT_LEN (1u)

/** \brief  Mask for Ifx_ERAY_STPW1_Bits.SSWT */
#define IFX_ERAY_STPW1_SSWT_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_STPW1_Bits.SSWT */
#define IFX_ERAY_STPW1_SSWT_OFF (3u)

/** \brief  Length for Ifx_ERAY_STPW1_Bits.SWMS */
#define IFX_ERAY_STPW1_SWMS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_STPW1_Bits.SWMS */
#define IFX_ERAY_STPW1_SWMS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_STPW1_Bits.SWMS */
#define IFX_ERAY_STPW1_SWMS_OFF (1u)

/** \brief  Length for Ifx_ERAY_STPW2_Bits.SSCVA */
#define IFX_ERAY_STPW2_SSCVA_LEN (11u)

/** \brief  Mask for Ifx_ERAY_STPW2_Bits.SSCVA */
#define IFX_ERAY_STPW2_SSCVA_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_STPW2_Bits.SSCVA */
#define IFX_ERAY_STPW2_SSCVA_OFF (0u)

/** \brief  Length for Ifx_ERAY_STPW2_Bits.SSCVB */
#define IFX_ERAY_STPW2_SSCVB_LEN (11u)

