luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_STPW2_Bits.SSCVB */
#define IFX_ERAY_STPW2_SSCVB_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_STPW2_Bits.SSCVB */
#define IFX_ERAY_STPW2_SSCVB_OFF (16u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.CCHA */
#define IFX_ERAY_SUCC1_CCHA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.CCHA */
#define IFX_ERAY_SUCC1_CCHA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.CCHA */
#define IFX_ERAY_SUCC1_CCHA_OFF (26u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.CCHB */
#define IFX_ERAY_SUCC1_CCHB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.CCHB */
#define IFX_ERAY_SUCC1_CCHB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.CCHB */
#define IFX_ERAY_SUCC1_CCHB_OFF (27u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.CMD */
#define IFX_ERAY_SUCC1_CMD_LEN (4u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.CMD */
#define IFX_ERAY_SUCC1_CMD_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.CMD */
#define IFX_ERAY_SUCC1_CMD_OFF (0u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.CSA */
#define IFX_ERAY_SUCC1_CSA_LEN (5u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.CSA */
#define IFX_ERAY_SUCC1_CSA_MSK (0x1fu)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.CSA */
#define IFX_ERAY_SUCC1_CSA_OFF (11u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.HCSE */
#define IFX_ERAY_SUCC1_HCSE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.HCSE */
#define IFX_ERAY_SUCC1_HCSE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.HCSE */
#define IFX_ERAY_SUCC1_HCSE_OFF (23u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.MTSA */
#define IFX_ERAY_SUCC1_MTSA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.MTSA */
#define IFX_ERAY_SUCC1_MTSA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.MTSA */
#define IFX_ERAY_SUCC1_MTSA_OFF (24u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.MTSB */
#define IFX_ERAY_SUCC1_MTSB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.MTSB */
#define IFX_ERAY_SUCC1_MTSB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.MTSB */
#define IFX_ERAY_SUCC1_MTSB_OFF (25u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.PBSY */
#define IFX_ERAY_SUCC1_PBSY_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.PBSY */
#define IFX_ERAY_SUCC1_PBSY_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.PBSY */
#define IFX_ERAY_SUCC1_PBSY_OFF (7u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.PTA */
#define IFX_ERAY_SUCC1_PTA_LEN (5u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.PTA */
#define IFX_ERAY_SUCC1_PTA_MSK (0x1fu)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.PTA */
#define IFX_ERAY_SUCC1_PTA_OFF (16u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.TSM */
#define IFX_ERAY_SUCC1_TSM_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.TSM */
#define IFX_ERAY_SUCC1_TSM_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.TSM */
#define IFX_ERAY_SUCC1_TSM_OFF (22u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.TXST */
#define IFX_ERAY_SUCC1_TXST_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.TXST */
#define IFX_ERAY_SUCC1_TXST_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.TXST */
#define IFX_ERAY_SUCC1_TXST_OFF (8u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.TXSY */
#define IFX_ERAY_SUCC1_TXSY_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.TXSY */
#define IFX_ERAY_SUCC1_TXSY_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.TXSY */
#define IFX_ERAY_SUCC1_TXSY_OFF (9u)

/** \brief  Length for Ifx_ERAY_SUCC1_Bits.WUCS */
#define IFX_ERAY_SUCC1_WUCS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SUCC1_Bits.WUCS */
#define IFX_ERAY_SUCC1_WUCS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SUCC1_Bits.WUCS */
#define IFX_ERAY_SUCC1_WUCS_OFF (21u)

/** \brief  Length for Ifx_ERAY_SUCC2_Bits.LT */
#define IFX_ERAY_SUCC2_LT_LEN (21u)

/** \brief  Mask for Ifx_ERAY_SUCC2_Bits.LT */
#define IFX_ERAY_SUCC2_LT_MSK (0x1fffffu)

/** \brief  Offset for Ifx_ERAY_SUCC2_Bits.LT */
#define IFX_ERAY_SUCC2_LT_OFF (0u)

/** \brief  Length for Ifx_ERAY_SUCC2_Bits.LTN */
#define IFX_ERAY_SUCC2_LTN_LEN (4u)

/** \brief  Mask for Ifx_ERAY_SUCC2_Bits.LTN */
#define IFX_ERAY_SUCC2_LTN_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_SUCC2_Bits.LTN */
#define IFX_ERAY_SUCC2_LTN_OFF (24u)

/** \brief  Length for Ifx_ERAY_SUCC3_Bits.WCF */
#define IFX_ERAY_SUCC3_WCF_LEN (4u)

/** \brief  Mask for Ifx_ERAY_SUCC3_Bits.WCF */
#define IFX_ERAY_SUCC3_WCF_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_SUCC3_Bits.WCF */
#define IFX_ERAY_SUCC3_WCF_OFF (4u)

/** \brief  Length for Ifx_ERAY_SUCC3_Bits.WCP */
#define IFX_ERAY_SUCC3_WCP_LEN (4u)

/** \brief  Mask for Ifx_ERAY_SUCC3_Bits.WCP */
#define IFX_ERAY_SUCC3_WCP_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_SUCC3_Bits.WCP */
#define IFX_ERAY_SUCC3_WCP_OFF (0u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.MTSA */
#define IFX_ERAY_SWNIT_MTSA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.MTSA */
#define IFX_ERAY_SWNIT_MTSA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.MTSA */
#define IFX_ERAY_SWNIT_MTSA_OFF (6u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.MTSB */
#define IFX_ERAY_SWNIT_MTSB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.MTSB */
#define IFX_ERAY_SWNIT_MTSB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.MTSB */
#define IFX_ERAY_SWNIT_MTSB_OFF (7u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.SBNA */
#define IFX_ERAY_SWNIT_SBNA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.SBNA */
#define IFX_ERAY_SWNIT_SBNA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.SBNA */
#define IFX_ERAY_SWNIT_SBNA_OFF (9u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.SBNB */
#define IFX_ERAY_SWNIT_SBNB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.SBNB */
#define IFX_ERAY_SWNIT_SBNB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.SBNB */
#define IFX_ERAY_SWNIT_SBNB_OFF (11u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.SBSA */
#define IFX_ERAY_SWNIT_SBSA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.SBSA */
#define IFX_ERAY_SWNIT_SBSA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.SBSA */
#define IFX_ERAY_SWNIT_SBSA_OFF (1u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.SBSB */
#define IFX_ERAY_SWNIT_SBSB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.SBSB */
#define IFX_ERAY_SWNIT_SBSB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.SBSB */
#define IFX_ERAY_SWNIT_SBSB_OFF (4u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.SENA */
#define IFX_ERAY_SWNIT_SENA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.SENA */
#define IFX_ERAY_SWNIT_SENA_MSK (0x1u)

