luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_bf.h
/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR116 */
#define IFX_ERAY_TXRQ4_TXR116_OFF (20u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR117 */
#define IFX_ERAY_TXRQ4_TXR117_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR117 */
#define IFX_ERAY_TXRQ4_TXR117_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR117 */
#define IFX_ERAY_TXRQ4_TXR117_OFF (21u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR118 */
#define IFX_ERAY_TXRQ4_TXR118_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR118 */
#define IFX_ERAY_TXRQ4_TXR118_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR118 */
#define IFX_ERAY_TXRQ4_TXR118_OFF (22u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR119 */
#define IFX_ERAY_TXRQ4_TXR119_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR119 */
#define IFX_ERAY_TXRQ4_TXR119_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR119 */
#define IFX_ERAY_TXRQ4_TXR119_OFF (23u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR120 */
#define IFX_ERAY_TXRQ4_TXR120_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR120 */
#define IFX_ERAY_TXRQ4_TXR120_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR120 */
#define IFX_ERAY_TXRQ4_TXR120_OFF (24u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR121 */
#define IFX_ERAY_TXRQ4_TXR121_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR121 */
#define IFX_ERAY_TXRQ4_TXR121_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR121 */
#define IFX_ERAY_TXRQ4_TXR121_OFF (25u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR122 */
#define IFX_ERAY_TXRQ4_TXR122_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR122 */
#define IFX_ERAY_TXRQ4_TXR122_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR122 */
#define IFX_ERAY_TXRQ4_TXR122_OFF (26u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR123 */
#define IFX_ERAY_TXRQ4_TXR123_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR123 */
#define IFX_ERAY_TXRQ4_TXR123_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR123 */
#define IFX_ERAY_TXRQ4_TXR123_OFF (27u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR124 */
#define IFX_ERAY_TXRQ4_TXR124_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR124 */
#define IFX_ERAY_TXRQ4_TXR124_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR124 */
#define IFX_ERAY_TXRQ4_TXR124_OFF (28u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR125 */
#define IFX_ERAY_TXRQ4_TXR125_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR125 */
#define IFX_ERAY_TXRQ4_TXR125_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR125 */
#define IFX_ERAY_TXRQ4_TXR125_OFF (29u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR126 */
#define IFX_ERAY_TXRQ4_TXR126_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR126 */
#define IFX_ERAY_TXRQ4_TXR126_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR126 */
#define IFX_ERAY_TXRQ4_TXR126_OFF (30u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR127 */
#define IFX_ERAY_TXRQ4_TXR127_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR127 */
#define IFX_ERAY_TXRQ4_TXR127_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR127 */
#define IFX_ERAY_TXRQ4_TXR127_OFF (31u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR96 */
#define IFX_ERAY_TXRQ4_TXR96_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR96 */
#define IFX_ERAY_TXRQ4_TXR96_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR96 */
#define IFX_ERAY_TXRQ4_TXR96_OFF (0u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR97 */
#define IFX_ERAY_TXRQ4_TXR97_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR97 */
#define IFX_ERAY_TXRQ4_TXR97_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR97 */
#define IFX_ERAY_TXRQ4_TXR97_OFF (1u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR98 */
#define IFX_ERAY_TXRQ4_TXR98_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR98 */
#define IFX_ERAY_TXRQ4_TXR98_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR98 */
#define IFX_ERAY_TXRQ4_TXR98_OFF (2u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR99 */
#define IFX_ERAY_TXRQ4_TXR99_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR99 */
#define IFX_ERAY_TXRQ4_TXR99_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR99 */
#define IFX_ERAY_TXRQ4_TXR99_OFF (3u)

/** \brief  Length for Ifx_ERAY_WRDS_Bits.MDWB0 */
#define IFX_ERAY_WRDS_MDWB0_LEN (8u)

/** \brief  Mask for Ifx_ERAY_WRDS_Bits.MDWB0 */
#define IFX_ERAY_WRDS_MDWB0_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_WRDS_Bits.MDWB0 */
#define IFX_ERAY_WRDS_MDWB0_OFF (0u)

/** \brief  Length for Ifx_ERAY_WRDS_Bits.MDWB1 */
#define IFX_ERAY_WRDS_MDWB1_LEN (8u)

/** \brief  Mask for Ifx_ERAY_WRDS_Bits.MDWB1 */
#define IFX_ERAY_WRDS_MDWB1_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_WRDS_Bits.MDWB1 */
#define IFX_ERAY_WRDS_MDWB1_OFF (8u)

/** \brief  Length for Ifx_ERAY_WRDS_Bits.MDWB2 */
#define IFX_ERAY_WRDS_MDWB2_LEN (8u)

/** \brief  Mask for Ifx_ERAY_WRDS_Bits.MDWB2 */
#define IFX_ERAY_WRDS_MDWB2_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_WRDS_Bits.MDWB2 */
#define IFX_ERAY_WRDS_MDWB2_OFF (16u)

/** \brief  Length for Ifx_ERAY_WRDS_Bits.MDWB3 */
#define IFX_ERAY_WRDS_MDWB3_LEN (8u)

/** \brief  Mask for Ifx_ERAY_WRDS_Bits.MDWB3 */
#define IFX_ERAY_WRDS_MDWB3_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_WRDS_Bits.MDWB3 */
#define IFX_ERAY_WRDS_MDWB3_OFF (24u)

/** \brief  Length for Ifx_ERAY_WRHS1_Bits.CFG */
#define IFX_ERAY_WRHS1_CFG_LEN (1u)

/** \brief  Mask for Ifx_ERAY_WRHS1_Bits.CFG */
#define IFX_ERAY_WRHS1_CFG_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_WRHS1_Bits.CFG */
#define IFX_ERAY_WRHS1_CFG_OFF (26u)

/** \brief  Length for Ifx_ERAY_WRHS1_Bits.CHA */
#define IFX_ERAY_WRHS1_CHA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_WRHS1_Bits.CHA */
#define IFX_ERAY_WRHS1_CHA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_WRHS1_Bits.CHA */
#define IFX_ERAY_WRHS1_CHA_OFF (24u)

/** \brief  Length for Ifx_ERAY_WRHS1_Bits.CHB */
#define IFX_ERAY_WRHS1_CHB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_WRHS1_Bits.CHB */
#define IFX_ERAY_WRHS1_CHB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_WRHS1_Bits.CHB */
#define IFX_ERAY_WRHS1_CHB_OFF (25u)

/** \brief  Length for Ifx_ERAY_WRHS1_Bits.CYC */
#define IFX_ERAY_WRHS1_CYC_LEN (7u)

/** \brief  Mask for Ifx_ERAY_WRHS1_Bits.CYC */
#define IFX_ERAY_WRHS1_CYC_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_WRHS1_Bits.CYC */
#define IFX_ERAY_WRHS1_CYC_OFF (16u)

/** \brief  Length for Ifx_ERAY_WRHS1_Bits.FID */
#define IFX_ERAY_WRHS1_FID_LEN (11u)

/** \brief  Mask for Ifx_ERAY_WRHS1_Bits.FID */
#define IFX_ERAY_WRHS1_FID_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_WRHS1_Bits.FID */
#define IFX_ERAY_WRHS1_FID_OFF (0u)

